
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИменаКонстант = "";
	Если ЗначениеЗаполнено(ИменаКонстант) Тогда
		
		Для Каждого ИмяКонстанты ИЗ СтрРазделить(ИменаКонстант, ",", Ложь) Цикл
			ЭтаФорма[ИмяКонстанты] = Константы[ИмяКонстанты].Получить();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонстанты(Элемент)
	
	ИзмененитьКонстантуНаСервере(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ИзмененитьКонстантуНаСервере(ИмяКонстанты)
	
	Константы[ИмяКонстанты].Установить(ЭтаФорма[ИмяКонстанты]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИмпортаЗамеровВремениSQL(Команда)
	
	ОткрытьФорму("Справочник.ПараметрыИмпортаЗамеровВремениSQL.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеОперации(Команда)
	
	ОткрытьФорму("Справочник.КлючевыеОперации.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиИмпортаЗамеровВремени(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиИмпортаЗамеровВремени.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ГраницыИмпортаЗамеровПроизводительности(Команда)
	
	ОткрытьФорму("РегистрСведений.ГраницыИмпортаЗамеровПроизводительности.ФормаСписка");
	
КонецПроцедуры
