
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ФайлСуществует(Знач ПолноеИмяФайла) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ФайлПроверка = Новый Файл(ПолноеИмяФайла);
	Если ФайлПроверка.Существует()
		И НЕ ФайлПроверка.ЭтоКаталог() Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция КаталогСуществует(Знач ПолноеИмяФайла) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ФайлПроверка = Новый Файл(ПолноеИмяФайла);
	Если ФайлПроверка.Существует()
		И ФайлПроверка.ЭтоКаталог() Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

Процедура КопироватьКаталог(Знач КаталогИсточник, Знач КаталогПриемник, Знач Маска = "*", Знач Рекурсивно = Ложь) Экспорт
	
	КаталогПриемник = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогПриемник);
	
	МассивФайлов = НайтиФайлы(КаталогИсточник, Маска, Ложь);
	Для Каждого ОписаниеФайла Из МассивФайлов Цикл
		
		ОписаниеФайла = Новый Файл;
		
		Если ОписаниеФайла.ЭтоКаталог() Тогда
			Если Рекурсивно Тогда
				Если НЕ КаталогСуществует(КаталогПриемник + ОписаниеФайла.Имя) Тогда
					СоздатьКаталог(КаталогПриемник + ОписаниеФайла.Имя);
				КонецЕсли;
				КопироватьКаталог(ОписаниеФайла.ПолноеИмя, КаталогПриемник + ОписаниеФайла.Имя, Маска, Рекурсивно);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		КопироватьФайл(ОписаниеФайла.ПолноеИмя, КаталогПриемник + ОписаниеФайла.Имя);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИмяФайла(Знач ПолноеИмяФайла) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Возврат "";
	КонецЕсли;
	
	Поз = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПоиска.СКонца);
	Поз = Макс(СтрНайти(ПолноеИмяФайла, "/", НаправлениеПоиска.СКонца), Поз);
	
	Если Поз = 0 Тогда
		Возврат ПолноеИмяФайла;
	КонецЕсли;
	
	ИмяФайла = Сред(ПолноеИмяФайла, Поз+1);
	Возврат ИмяФайла;
	
КонецФункции

Функция ИмяФайлаБезРасширения(Знач ПолноеИмяФайла) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяФайла = ИмяФайла(ПолноеИмяФайла);
	
	Поз = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца);
	Если Поз > 1 Тогда
		ИмяФайла = Лев(ИмяФайла, Поз-1);
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ЕстьФайлыПоМаске(Знач Каталог, Знач Маска, Знач ИскатьВПодкаталогах = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Каталог) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Маска) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ КаталогСуществует(Каталог) Тогда
		Возврат Ложь;
	КонецЕсли;
	
    НайденныеФайлы = НайтиФайлы(Каталог, Маска, ИскатьВПодкаталогах);
    Если НайденныеФайлы.Количество() > 0 Тогда
		
		Для Каждого ОписаниеФайла Из НайденныеФайлы Цикл
			
			Если ОписаниеФайла.ЭтоФайл() Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;
		
    КонецЕсли;
	
	Возврат Ложь;
	
	
КонецФункции


#КонецЕсли