
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Конфигурация = Объект.База1С.ПоставляемаяКонфигурация;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Конфигурация = Объект.База1С.ПоставляемаяКонфигурация;
	
КонецПроцедуры

&НаКлиенте
Процедура База1СПриИзменении(Элемент)
	
	База1СПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура База1СПриИзмененииНаСервере()
	
	Если Конфигурация <> Объект.База1С.ПоставляемаяКонфигурация Тогда
		
		Конфигурация = Объект.База1С.ПоставляемаяКонфигурация;
		Объект.ИдентификаторМетаданных = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры
