
Функция База1СПоID(Знач ID) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ID) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторЖурналаИсключений", ID);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	БазыДанных1С.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БазыДанных1С КАК БазыДанных1С
	|ГДЕ
	|	БазыДанных1С.ИдентификаторЖурналаИсключений = &ИдентификаторЖурналаИсключений";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
