
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОписаниеПараметровДоступа(ПараметрыДоступа) Экспорт
	
	ПараметрДоступа = ПараметрыДоступа.Добавить();
	ПараметрДоступа.Имя = "ИмяСлужебногоПользователя1С";
	ПараметрДоступа.Синоним = "";
	ПараметрДоступа.РежимПароля = Ложь;
	
	ПараметрДоступа = ПараметрыДоступа.Добавить();
	ПараметрДоступа.Имя = "ПарольСлужебногоПользователя1С";
	ПараметрДоступа.Синоним = "";
	ПараметрДоступа.НеСчитыватьДанные = Истина;
	ПараметрДоступа.РежимПароля = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипыСекретовКонфигураций1С.Наименование КАК Имя,
	|	ТипыСекретовКонфигураций1С.Синоним КАК Синоним,
	|	ТипыСекретовКонфигураций1С.РежимПароля КАК РежимПароля,
	|	ТипыСекретовКонфигураций1С.НеСчитыватьДанные КАК НеСчитыватьДанные
	|ИЗ
	|	Справочник.ТипыСекретовКонфигураций1С КАК ТипыСекретовКонфигураций1С
	|ГДЕ
	|	НЕ ТипыСекретовКонфигураций1С.ЭтоГруппа
	|	И НЕ ТипыСекретовКонфигураций1С.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыСекретовКонфигураций1С.ПорядокВывода";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрДоступа = ПараметрыДоступа.Добавить();
		ПараметрДоступа.Имя = Выборка.Имя;
		ПараметрДоступа.Синоним = Выборка.Синоним;
		ПараметрДоступа.НеСчитыватьДанные = Выборка.НеСчитыватьДанные;
		ПараметрДоступа.РежимПароля = Выборка.РежимПароля;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
