
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИменаКонстант = "СерверДляИнтеграцииСJira,ШаблонДляСозданияНовыхЗадач";
	Если ЗначениеЗаполнено(ИменаКонстант) Тогда
		
		Для Каждого ИмяКонстанты ИЗ СтрРазделить(ИменаКонстант, ",", Ложь) Цикл
			ЭтаФорма[ИмяКонстанты] = Константы[ИмяКонстанты].Получить();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонстанты(Элемент)
	
	ИзмененитьКонстантуНаСервере(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ИзмененитьКонстантуНаСервере(ИмяКонстанты)
	
	Константы[ИмяКонстанты].Установить(ЭтаФорма[ИмяКонстанты]);
	
КонецПроцедуры
