
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИменаКонстант = "База1СДляПросмотраИсключенийПоУмолчанию,ГруппаПолучателейИсключенийПоУмолчанию,ГруппаОбязательныхПолучателейИсключений";
	
	Для Каждого ИмяКонстанты ИЗ СтрРазделить(ИменаКонстант, ",", Ложь) Цикл
		ЭтаФорма[ИмяКонстанты] = Константы[ИмяКонстанты].Получить();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонстанты(Элемент)
	
	ИзмененитьКонстантуНаСервере(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ИзмененитьКонстантуНаСервере(ИмяКонстанты)
	
	Константы[ИмяКонстанты].Установить(ЭтаФорма[ИмяКонстанты]);
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорииИсключений(Команда)
	
	ОткрытьФорму("Справочник.КатегорииИсключений.ФормаСписка");
	
КонецПроцедуры

