
#Область ПрограммныйИнтерфейс

Функция ИмяСтиляПриложенияПользователя(Знач ИмяПользователя = Неопределено) Экспорт
	
	ИмяСтиля = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОсновнойСтильПриложенияПользователя",, Неопределено,, ИмяПользователя);
	Если НЕ ЗначениеЗаполнено(ИмяСтиля) Тогда
		ИмяСтиля = "";
	КонецЕсли;
	
	Если Метаданные.Стили.Найти(ИмяСтиля) = Неопределено Тогда
		ИмяСтиля = "";
	КонецЕсли;
	
	Возврат ИмяСтиля;
	
КонецФункции

Процедура УстановитьИмяСтиляПриложенияПользователя(Знач ИмяСтиля = "", Знач ИмяПользователя = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяСтиля) Тогда
		ИмяСтиля = "";
		ОбщегоНазначения.ХранилищеОбщихНастроекУдалить("ОсновнойСтильПриложенияПользователя",, ИмяПользователя);
	Иначе
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ОсновнойСтильПриложенияПользователя",, ИмяСтиля,, ИмяПользователя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
