
//Функция КомпьютерПользователяПоИмени(Знач ИмяКомпьютера) Экспорт
//	
//	Если НЕ ЗначениеЗаполнено(ИмяКомпьютера) Тогда
//		Возврат Справочники.КомпьютерыПользователей.ПустаяСсылка();	
//	КонецЕсли; 
//	
//	ИмяСобытия = СокрЛП(ИмяКомпьютера);
//	Если СтрДлина(ИмяКомпьютера) > 150 Тогда
//		ИмяСобытия = Лев(ИмяКомпьютера, 150);
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	Компьютеры.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.Компьютеры КАК Компьютеры
//	|ГДЕ
//	|	Компьютеры.Наименование = &ИмяКомпьютера";
//	
//	СсылкаНаСобытие = Неопределено;
//	
//	УстановитьПривилегированныйРежим(Истина);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		СсылкаНаСобытие = Выборка.Ссылка;
//	КонецЕсли;
//	УстановитьПривилегированныйРежим(Ложь);
//	
//	Если ЗначениеЗаполнено(СсылкаНаСобытие) Тогда
//		Возврат СсылкаНаСобытие;
//	КонецЕсли;
//	
//	УстановитьПривилегированныйРежим(Истина);
//	НачатьТранзакцию();
//	
//	//Блокировка = Новый БлокировкаДанных;
//	//ЭлементБлокировки = Блокировка.Добавить("Справочник.КомпьютерыПользователей");
//	//ЭлементБлокировки.УстановитьЗначение("Наименование", ИмяКомпьютера);
//	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
//	//Блокировка.Заблокировать();

//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		СсылкаНаСобытие = Выборка.Ссылка;
//	КонецЕсли;
//	
//	Если НЕ ЗначениеЗаполнено(СсылкаНаСобытие) Тогда
//		
//		Событие = Справочники.Компьютеры.СоздатьЭлемент();
//		Событие.Наименование = ИмяКомпьютера;
//		
//		Событие.ОбменДанными.Загрузка = Истина;
//		Событие.Записать();
//		
//		СсылкаНаСобытие = Событие.Ссылка;
//		
//	КонецЕсли;
//	
//	ЗафиксироватьТранзакцию();
//	УстановитьПривилегированныйРежим(Ложь);
//	
//	Возврат СсылкаНаСобытие;
//	
//КонецФункции


