
Функция ФайлСуществуетНаСвервере(Знач ПолноеИмяФайла) Экспорт
	
	Результат = _ФайлыКлиентСервер.ФайлСуществует(ПолноеИмяФайла);
	Если Результат Тогда
		
		// Романов 09/11/22 DEV-807
		ПолноеИмяФайла = ВРег(СтрЗаменить(ПолноеИмяФайла, " ", ""));
		Если СтрНачинаетсяС(ПолноеИмяФайла, "C:")
			ИЛИ СтрНачинаетсяС(ПолноеИмяФайла, "D:")
			ИЛИ СтрНачинаетсяС(ПолноеИмяФайла, "E:")
			ИЛИ СтрНачинаетсяС(ПолноеИмяФайла, "F:") Тогда
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КаталогСуществуетНаСвервере(Знач ПолноеИмяФайла) Экспорт
	
	Результат = _ФайлыКлиентСервер.КаталогСуществует(ПолноеИмяФайла);
	Если Результат Тогда
		
		// Романов 09/11/22 DEV-807
		ПолноеИмяФайла = ВРег(СтрЗаменить(ПолноеИмяФайла, " ", ""));
		Если СтрНачинаетсяС(ПолноеИмяФайла, "C:")
			ИЛИ СтрНачинаетсяС(ПолноеИмяФайла, "D:")
			ИЛИ СтрНачинаетсяС(ПолноеИмяФайла, "E:")
			ИЛИ СтрНачинаетсяС(ПолноеИмяФайла, "F:") Тогда
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
