
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(commad) Тогда
		commad = КомандаЗапросаSQL(текстЗапросаSQL);
	КонецЕсли;
	
	
КонецПроцедуры

Функция КомандаЗапросаSQL(Знач ТекстЗапроса)
	
	ТекстЗапроса = ВРег(ТекстЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "      ", " ");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "    ", " ");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "  ", " ");
	
	Если СтрНайти(ТекстЗапроса, "ALTER INDEX") > 0 Тогда
		Возврат "ALTER INDEX";
	КонецЕсли;
	
	Если СтрНайти(ТекстЗапроса, "ALTER TABLE") > 0 Тогда
		Возврат "ALTER TABLE";
	КонецЕсли;
	
	Если СтрНайти(ТекстЗапроса, "ALTER") > 0 Тогда
		Возврат "ALTER";
	КонецЕсли;
	
	Если СтрНайти(ТекстЗапроса, "CREATE") > 0 Тогда
		Возврат "CREATE";
	КонецЕсли;

	Если СтрНайти(ТекстЗапроса, "DELETE") > 0 Тогда
		Возврат "DELETE";
	КонецЕсли;

	Если СтрНайти(ТекстЗапроса, "BACKUP") > 0 Тогда
		Возврат "BACKUP";
	КонецЕсли;

	Если СтрНайти(ТекстЗапроса, "INSERT") > 0 Тогда
		Возврат "INSERT";
	КонецЕсли;

	Если СтрНайти(ТекстЗапроса, "UPDATE") > 0 Тогда
		Возврат "UPDATE";
	КонецЕсли;

	Если СтрНайти(ТекстЗапроса, "MERGE") > 0 Тогда
		Возврат "MERGE";
	КонецЕсли;

	Если СтрНайти(ТекстЗапроса, "DROP") > 0 Тогда
		Возврат "DROP";
	КонецЕсли;

	Если СтрНайти(ТекстЗапроса, "DBCC") > 0 Тогда
		Возврат "DBCC";
	КонецЕсли;

	Если СтрНайти(ТекстЗапроса, "SELECT") > 0 Тогда
		Возврат "SELECT";
	КонецЕсли;
	
	Если СтрНайти(ТекстЗапроса, "AWAITING") > 0 Тогда
		Возврат "AWAITING";
	КонецЕсли;

	Возврат "";
	
КонецФункции