

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные_АктивныеЗапросыНаСервере(ТекДата = Неопределено)
	
	АктивныеЗапросы.Очистить();
	Если НЕ ЗначениеЗаполнено(СерверSQL) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СерверSQL", СерверSQL);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыСобранныхЗапросовSQL.ДатаПоследнегоСбора КАК ДатаПоследнегоСбора
	|ИЗ
	|	РегистрСведений.ДатыСобранныхЗапросовSQL КАК ДатыСобранныхЗапросовSQL
	|ГДЕ
	|	ДатыСобранныхЗапросовSQL.СерверSQL = &СерверSQL";
	
	ДатаОбновления = Неопределено;
	ВыборкаДаты = Запрос.Выполнить().Выбрать();
	Если ВыборкаДаты.Следующий() Тогда
		ДатаОбновления = ВыборкаДаты.ДатаПоследнегоСбора;
	КонецЕсли;
	
	Если ДатаОбновления = Неопределено
		ИЛИ ТекДата = Неопределено
		ИЛИ (ТекДата - ДатаОбновления) > 20 Тогда
		
		СборДанныхОПроизводительности.Регламент_СборДанныхSQL();
		
		ДатаОбновления = Неопределено;
		ВыборкаДаты = Запрос.Выполнить().Выбрать();
		Если ВыборкаДаты.Следующий() Тогда
			ДатаОбновления = ВыборкаДаты.ДатаПоследнегоСбора;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДатаОбновления = Неопределено Тогда
		Если ТекДата = Неопределено
			ИЛИ (ТекДата - ДатаОбновления) > 20 Тогда
		
			ВызватьИсключение "Не заполнена настройка сбора данных с сервера";
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаОбновления", ДатаОбновления);
	//Если ТекДата = Неопределено Тогда
	//	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяУниверсальнаяДата()-43200);
	//Иначе
	//	Запрос.УстановитьПараметр("ДатаНачала", ТекДата-43200);
	//КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СобранныеЗапросыSQL.ДатаНачала КАК ДатаНачала,
	|	СобранныеЗапросыSQL.СерверSQL КАК СерверSQL,
	|	СобранныеЗапросыSQL.ID КАК ID,
	|	СобранныеЗапросыSQL.session КАК session,
	|	СобранныеЗапросыSQL.status КАК status,
	|	СобранныеЗапросыSQL.commad КАК commad,
	|	СобранныеЗапросыSQL.CPU КАК CPU,
	|	СобранныеЗапросыSQL.duration КАК duration,
	|	СобранныеЗапросыSQL.ЗапросSQL КАК ЗапросSQL,
	|	СобранныеЗапросыSQL.ДатаОбновления КАК ДатаОбновления,
	|	СобранныеЗапросыSQL.ЗапросSQL.ТекстЗапросаSQL КАК текстЗапросаSQL,
	|	СобранныеЗапросыSQL.ЗапросSQL.ТекстЗапроса1С КАК текстЗапроса1С,
	|	СобранныеЗапросыSQL.ЗапросSQL.Комментарий КАК КомментарийПоЗапросу,
	|	СобранныеЗапросыSQL.dbname КАК dbname
	|ИЗ
	|	РегистрСведений.СобранныеЗапросыSQL КАК СобранныеЗапросыSQL
	|ГДЕ
	|	СобранныеЗапросыSQL.СерверSQL = &СерверSQL
	|	И СобранныеЗапросыSQL.ДатаОбновления = &ДатаОбновления";
	
	ТЧ_SQL = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка_SQL Из ТЧ_SQL Цикл
		
		НоваяСтрока = АктивныеЗапросы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка_SQL);
		
	КонецЦикла;
	
	//ДатаОбновленияЗапросы = МестноеВремя(ДатаОбновления, ЧасовойПоясСеанса());
	ДатаОбновленияЗапросы = ДатаОбновления;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные_ТранзакцииНаСервере(ТекДата = Неопределено)
	
	АктивныеТранзакции.Очистить();
	Если НЕ ЗначениеЗаполнено(СерверSQL) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СерверSQL", СерверSQL);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыСобранныхТранзакцийSQL.ДатаПоследнегоСбора КАК ДатаПоследнегоСбора
	|ИЗ
	|	РегистрСведений.ДатыСобранныхТранзакцийSQL КАК ДатыСобранныхТранзакцийSQL
	|ГДЕ
	|	ДатыСобранныхТранзакцийSQL.СерверSQL = &СерверSQL";
	
	ДатаОбновления = Неопределено;
	ВыборкаДаты = Запрос.Выполнить().Выбрать();
	Если ВыборкаДаты.Следующий() Тогда
		ДатаОбновления = ВыборкаДаты.ДатаПоследнегоСбора;
	КонецЕсли;
	
	Если ДатаОбновления = Неопределено
		ИЛИ ТекДата = Неопределено
		ИЛИ (ТекДата - ДатаОбновления) > 20 Тогда
		
		СборДанныхОПроизводительности.Регламент_СборДанныхSQL();
		
		ДатаОбновления = Неопределено;
		ВыборкаДаты = Запрос.Выполнить().Выбрать();
		Если ВыборкаДаты.Следующий() Тогда
			ДатаОбновления = ВыборкаДаты.ДатаПоследнегоСбора;
		КонецЕсли;
		
	КонецЕсли;

	Если ДатаОбновления = Неопределено Тогда
		Если ТекДата = Неопределено
			ИЛИ (ТекДата - ДатаОбновления) > 20 Тогда
			
			Сообщить("Не заполнена настройка сбора данных с сервера");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаОбновления", ДатаОбновления);
	//Запрос.УстановитьПараметр("ДатаНачала", ТекДата-43200);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СобранныеТранзакцииSQL.ДатаНачала КАК ДатаНачала,
	|	СобранныеТранзакцииSQL.СерверSQL КАК СерверSQL,
	|	СобранныеТранзакцииSQL.ID КАК ID,
	|	СобранныеТранзакцииSQL.session КАК session,
	|	СобранныеТранзакцииSQL.duration КАК duration,
	|	СобранныеТранзакцииSQL.type КАК type,
	|	СобранныеТранзакцииSQL.state КАК state,
	|	СобранныеТранзакцииSQL.num_reads КАК num_reads,
	|	СобранныеТранзакцииSQL.num_writes КАК num_writes,
	|	СобранныеТранзакцииSQL.client_ip КАК client_ip,
	|	СобранныеТранзакцииSQL.ib_name КАК ib_name,
	|	СобранныеТранзакцииSQL.wait_type КАК wait_type,
	|	СобранныеТранзакцииSQL.wait_time КАК wait_time,
	|	СобранныеТранзакцииSQL.ЗапросSQL КАК ЗапросSQL,
	|	СобранныеТранзакцииSQL.ДатаОбновления КАК ДатаОбновления,
	|	СобранныеТранзакцииSQL.ЗапросSQL.ТекстЗапросаSQL КАК текстЗапросаSQL,
	|	СобранныеТранзакцииSQL.ЗапросSQL.ТекстЗапроса1С КАК текстЗапроса1С,
	|	СобранныеТранзакцииSQL.ЗапросSQL.Комментарий КАК КомментарийПоЗапросу,
	|	СобранныеТранзакцииSQL.dbname КАК dbname
	|ИЗ
	|	РегистрСведений.СобранныеТранзакцииSQL КАК СобранныеТранзакцииSQL
	|ГДЕ
	|	СобранныеТранзакцииSQL.СерверSQL = &СерверSQL
	|	И СобранныеТранзакцииSQL.ДатаОбновления = &ДатаОбновления";

	ТЧ_SQL = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка_SQL Из ТЧ_SQL Цикл
		
		НоваяСтрока = АктивныеТранзакции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка_SQL);
		
	КонецЦикла;
	
	//ДатаОбновленияТранзакции = МестноеВремя(ДатаОбновления, ЧасовойПоясСеанса());
	ДатаОбновленияТранзакции = ДатаОбновления;
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	ТекДата = ТекущаяУниверсальнаяДата();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбновитьДанные_АктивныеЗапросыНаСервере(ТекДата);
	ОбновитьДанные_ТранзакцииНаСервере(ТекДата);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеТаблиц() Экспорт
	
	ОбновитьДанныеНаСервере();
	
	Если АвтообновлениеЗапущено Тогда
		Текст_ДекорацияАвтообновление = "Автообновление запущено; ";
	Иначе
		Текст_ДекорацияАвтообновление = "";
	КонецЕсли;
	Текст_ДекорацияАвтообновление = Текст_ДекорацияАвтообновление + "запуск: " + ТекущаяДата();
	
	Элементы.ДекорацияАвтообновление.Заголовок = Текст_ДекорацияАвтообновление;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеТаблиц();
КонецПроцедуры


&НаКлиенте
Процедура ЗапуститьАвтообновление(Команда)
	
	Если НЕ АвтообновлениеЗапущено Тогда
		
		// Проверка параметров, пусть лучше тут выкинет )))
		ОбновитьДанныеТаблиц();
		
		АвтообновлениеЗапущено = Истина;
		
		ИнтервалОбновления = ЧастотаОбновления;
		ИнтервалОбновления = Мин(ИнтервалОбновления, 5);
		
		ПодключитьОбработчикОжидания("ОбновитьДанныеТаблиц", ИнтервалОбновления);
		
	Иначе
		
		АвтообновлениеЗапущено = Ложь;
		ОтключитьОбработчикОжидания("ОбновитьДанныеТаблиц");
		
	КонецЕсли;
	
	ОбновитьЗаголовокКомандыАвтообновленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокКомандыАвтообновленияНаСервере()
	
	Если АвтообновлениеЗапущено Тогда
		Команды.ЗапуститьАвтообновление.Заголовок = "Отключить автообновление";
	Иначе
		Команды.ЗапуститьАвтообновление.Заголовок = "Запустить автообновление";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УбитьПроцессНаСервере(НомерСеанса)
	
	ТекстЗапроса = "kill " + Формат(НомерСеанса, "ЧГ=");
	РаботаСSQLСервером.ВыполнитьКомандуSQL(ТекстЗапроса, СерверSQL);
	
	ОбновитьДанные_АктивныеЗапросыНаСервере();
	ОбновитьДанные_ТранзакцииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УбитьСеансЗапроса(Команда)

	Идент = Элементы.АктивныеЗапросы.ТекущиеДанные.ПолучитьИдентификатор();
	ТекСеанс = "0";
	АктивныеЗапросы.НайтиПоИдентификатору(Идент).Свойство("session",ТекСеанс);
	Если ТекСеанс = "0" ИЛИ НЕ ЗначениеЗаполнено(ТекСеанс) Тогда 
		Возврат;
	КонецЕсли;
	
	Ответ = Вопрос("Вы уверены, что необходимо убрать сеанс #№ " + ТекСеанс + "?",РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		УбитьПроцессНаСервере(ТекСеанс);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УбитьСеансТранзакции(Команда)

	Идент = Элементы.АктивныеТранзакции.ТекущиеДанные.ПолучитьИдентификатор();
	ТекСеанс = "0";
	АктивныеТранзакции.НайтиПоИдентификатору(Идент).Свойство("session",ТекСеанс);
	Если ТекСеанс = "0" ИЛИ НЕ ЗначениеЗаполнено(ТекСеанс) Тогда 
		Возврат;
	КонецЕсли;
	
	Ответ = Вопрос("Вы уверены, что необходимо убрать сеанс #№ " + ТекСеанс + "?",РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		УбитьПроцессНаСервере(ТекСеанс);
	КонецЕсли;
	
КонецПроцедуры

