
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заполнить_ОсновнойСтильПриложенияПользователя();
	
КонецПроцедуры

&НаСервере
Процедура Заполнить_ОсновнойСтильПриложенияПользователя()
	
	спИменаСтилей = Элементы.ОсновнойСтильПриложенияПользователя.СписокВыбора;
	
	Для Каждого мтдСтиля Из Метаданные.Стили Цикл
		спИменаСтилей.Добавить(мтдСтиля.Имя, мтдСтиля.Синоним);
	КонецЦикла;
	
	спИменаСтилей.Добавить("ПоУмолчанию", "По умолчанию");
	
	ИмяСтиляВНастройках = _НастройкиПользователейВызовСервера.ИмяСтиляПриложенияПользователя();
	Если ЗначениеЗаполнено(ИмяСтиляВНастройках)
		И спИменаСтилей.НайтиПоЗначению(ИмяСтиляВНастройках) <> Неопределено Тогда
			
		ОсновнойСтильПриложенияПользователя = ИмяСтиляВНастройках;
	Иначе
		ОсновнойСтильПриложенияПользователя = "ПоУмолчанию";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойСтильПриложенияПользователяПриИзменении(Элемент)
	
	ОсновнойСтильПриложенияПользователяПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОсновнойСтильПриложенияПользователяПриИзмененииНаСервере()
	
	_НастройкиПользователейВызовСервера.УстановитьИмяСтиляПриложенияПользователя(ОсновнойСтильПриложенияПользователя);
	
КонецПроцедуры