
#Область СлужебныеКоннекторHTTP

&НаСервере
Функция ПолучитьДвоичныеДанныеКартинки(ПараметрыВыполнения, Путь)
	
	Если НЕ ПустаяСтрока(Путь) тогда
		
		СтруктураВозврата = Новый Структура;
		
		ТекущаяСессия = УИ_КоннекторHTTP.СоздатьСессию();
		Заголовки = ПолучитьЗаголовокиПодключения("http", "http");
		
		ПараметрыЗапроса = Новый Структура("Заголовки", Заголовки);
		ДополнительныеПараметры = Новый Структура();
		УИ_КоннекторHTTP.ЗаполнитьДополнительныеДанные(ДополнительныеПараметры, ПараметрыЗапроса, Неопределено, Неопределено);
		ДополнительныеПараметры.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
		
		Ответ = УИ_КоннекторHTTP.ВызватьHTTPМетод(ТекущаяСессия, "GET", Путь, ДополнительныеПараметры);
		
		Заг = УИ_КоннекторHTTP.ПолучитьЗначениеЗаголовка("content-type", Ответ.Заголовки);
		Если Заг <> Ложь Тогда
			Если Найти(НРег(Заг),"jpeg") > 0 Тогда
				СтруктураВозврата.Вставить("Расширение", "jpg");	
			КонецЕсли;
		КонецЕсли;
		
		СтруктураВозврата.Вставить("ДвоичныеДанныеКартинки", УИ_КоннекторHTTP.КакДвоичныеДанные(Ответ));	
		
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;
	Конецесли;
	
КонецФункции

&НаСервере
Функция ПолучитьЗаголовокиПодключения(ФорматОтправки, ФорматПриема) Экспорт
	
	Перем Заголовки;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type",			"application/"+ФорматОтправки);
	Заголовки.Вставить("Accept",				"application/"+ФорматПриема+";charset=UTF-8");
	
	Возврат Заголовки;

КонецФункции

#КонецОбласти
