
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИменаКонстант = "ПровайдерSQL,СохранятьПланыЗапросовSQL,ГруппаПолучателейПисемОДлиттельныхЗапросов,ДлительностьЗапросовСОповещениями";
	
	Для Каждого ИмяКонстанты ИЗ СтрРазделить(ИменаКонстант, ",", Ложь) Цикл
		ЭтаФорма[ИмяКонстанты] = Константы[ИмяКонстанты].Получить();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонстанты(Элемент)
	
	ИзмененитьКонстантуНаСервере(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ИзмененитьКонстантуНаСервере(ИмяКонстанты)
	
	Константы[ИмяКонстанты].Установить(ЭтаФорма[ИмяКонстанты]);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСбораДанныхSQL(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиСбораДанныхSQL.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаПоОжиданиямSQL(Команда)
	
	ОткрытьФорму("РегистрСведений.СтатистикаПоОжиданиямSQL.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросыSQL(Команда)

	ОткрытьФорму("Справочник.ЗапросыSQL.ФормаСписка");
	
КонецПроцедуры

