
Функция КомпьютерПользователяПоИмени(Знач ИмяКомпьютера) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяКомпьютера) Тогда
		Возврат Справочники.Компьютеры.ПустаяСсылка();	
	КонецЕсли; 
	
	ИмяКомпьютераН = СокрЛП(ИмяКомпьютера);
	Если СтрДлина(ИмяКомпьютераН) > 150 Тогда
		ИмяКомпьютераН = Лев(ИмяКомпьютера, 150);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютераН);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Компьютеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Компьютеры КАК Компьютеры
	|ГДЕ
	|	Компьютеры.Наименование = &ИмяКомпьютера";
	
	СпрСсылка = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СпрСсылка = Выборка.Ссылка;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(СпрСсылка) Тогда
		Возврат СпрСсылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("Справочник.КомпьютерыПользователей");
	//ЭлементБлокировки.УстановитьЗначение("Наименование", ИмяКомпьютера);
	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//Блокировка.Заблокировать();

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СпрСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СпрСсылка) Тогда
		
		СпрОб = Справочники.Компьютеры.СоздатьЭлемент();
		СпрОб.Наименование = ИмяКомпьютераН;
		
		СпрОб.ОбменДанными.Загрузка = Истина;
		СпрОб.Записать();
		
		СпрСсылка = СпрОб.Ссылка;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СпрСсылка;
	
КонецФункции

Функция ПользовательБазыПоИмени(Знач ИмяПользователя, Знач База1С) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяПользователя) Тогда
		Возврат Справочники.ПользователиБаз1С.ПустаяСсылка();	
	КонецЕсли; 
	
	ИмяПользователяН = СокрЛП(ИмяПользователя);
	Если СтрДлина(ИмяПользователяН) > 150 Тогда
		ИмяПользователяН = Лев(ИмяПользователя, 150);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", ИмяПользователяН);
	Запрос.УстановитьПараметр("База1С", База1С);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПользователиБаз1С.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПользователиБаз1С КАК ПользователиБаз1С
	|ГДЕ
	|	ПользователиБаз1С.Наименование = &Наименование
	|	И ПользователиБаз1С.Владелец = &База1С";
	
	СпрСсылка = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СпрСсылка = Выборка.Ссылка;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(СпрСсылка) Тогда
		Возврат СпрСсылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("Справочник.ПользователиБаз1С");
	//ЭлементБлокировки.УстановитьЗначение("Наименование", ИмяКомпьютера);
	//ЭлементБлокировки.УстановитьЗначение("Владелец", База1С);
	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//Блокировка.Заблокировать();

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СпрСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СпрСсылка) Тогда
		
		СпрОб = Справочники.ПользователиБаз1С.СоздатьЭлемент();
		СпрОб.Владелец = База1С;
		СпрОб.Наименование = ИмяПользователяН;
		
		СпрОб.ОбменДанными.Загрузка = Истина;
		СпрОб.Записать();
		
		СпрСсылка = СпрОб.Ссылка;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СпрСсылка;
	
КонецФункции

Функция ВерсияБазыДанных(Знач НомерВерсии, Знач База1С) Экспорт
	
	Если НЕ ЗначениеЗаполнено(База1С) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоставляемаяКонфигурация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(База1С, "ПоставляемаяКонфигурация");
	Если НЕ ЗначениеЗаполнено(ПоставляемаяКонфигурация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ВерсияКонфигурации(НомерВерсии, База1С.ПоставляемаяКонфигурация);
	
КонецФункции

Функция ВерсияКонфигурации(Знач НомерВерсии, Знач ПоставляемаяКонфигурация1С) Экспорт

	Если НЕ ЗначениеЗаполнено(ПоставляемаяКонфигурация1С) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НомерВерсии = СокрЛП(НомерВерсии);
	НомерВерсии = СтрЗаменить(НомерВерсии, " ", "");
	НомерВерсии = СтрЗаменить(НомерВерсии, ",", ".");
	НомерВерсии = СтрЗаменить(НомерВерсии, ":", ".");
	НомерВерсии = СтрЗаменить(НомерВерсии, ";", ".");
	НомерВерсии = СтрЗаменить(НомерВерсии, "/", ".");
	НомерВерсии = СтрЗаменить(НомерВерсии, "\", ".");
	НомерВерсии = СтрЗаменить(НомерВерсии, "|", ".");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерВерсии", НомерВерсии);
	Запрос.УстановитьПараметр("ПоставляемаяКонфигурация1С", ПоставляемаяКонфигурация1С);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииКонфигураций1С.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВерсииКонфигураций1С КАК ВерсииКонфигураций1С
	|ГДЕ
	|	ВерсииКонфигураций1С.Код = &НомерВерсии
	|	И ВерсииКонфигураций1С.Владелец = &ПоставляемаяКонфигурация1С";
	
	СпрСсылка = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СпрСсылка = Выборка.Ссылка;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(СпрСсылка) Тогда
		Возврат СпрСсылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("Справочник.ВерсииКонфигураций1С");
	//ЭлементБлокировки.УстановитьЗначение("Код", НомерВерсии);
	//ЭлементБлокировки.УстановитьЗначение("Владелец", ПоставляемаяКонфигурация1С);
	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//Блокировка.Заблокировать();

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СпрСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СпрСсылка) Тогда
		
		СпрОб = Справочники.ВерсииКонфигураций1С.СоздатьЭлемент();
		СпрОб.Код = НомерВерсии;
		СпрОб.Владелец = ПоставляемаяКонфигурация1С;
		
		СпрОб.ОбменДанными.Загрузка = Истина;
		СпрОб.Записать();
		
		СпрСсылка = СпрОб.Ссылка;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СпрСсылка;
	
КонецФункции
