
Функция ПровайдерSQLПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПровайдерSQL = Константы.ПровайдерSQL.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ ЗначениеЗаполнено(ПровайдерSQL) Тогда
		ПровайдерSQL = "SQLOLEDB.1";
	КонецЕсли;
	
	Возврат ПровайдерSQL;
	
КонецФункции

Функция ВидыОжиданийSQLПоИмени(Знач ИмяВида) Экспорт
	
	Если ПустаяСтрока(ИмяВида) Тогда
		Возврат Справочники.ВидыОжиданийSQL.ПустаяСсылка();
	КонецЕсли;
	
	ИмяВида = СокрЛП(ИмяВида);
	Если СтрДлина(ИмяВида) > 150 Тогда
		ИмяВида = Лев(ИмяВида, 150);
	КонецЕсли;
	
	ВидОжиданий = Справочники.ВидыОжиданийSQL.НайтиПоНаименованию(ИмяВида, Истина);
	
	Если НЕ ЗначениеЗаполнено(ВидОжиданий) Тогда
		
		ВидОжиданийОбъект = Справочники.ВидыОжиданийSQL.СоздатьЭлемент();
		ВидОжиданийОбъект.Наименование = ИмяВида;
		
		ВидОжиданийОбъект.Записать();
		ВидОжиданий = ВидОжиданийОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат ВидОжиданий;
	
КонецФункции